{
    "text": "Yes, hi Eric. The installed base hit an all-time high during the quarter and so we were very happy about that. iPhone in general grew in constant currency. And the 15, as you point out, if you look at the same number of weeks of the 15 from launch and compare that to the 14, the 15 is doing better than the 14. And so that's kind of a state of where we currently are. In terms of upgrade rates, it's very difficult mid-cycle to call upgrade rates. I would just say that with Apple Intelligence, we are very excited about the level of value that we're going to provide to users. And we believe that -- that presents another reason for a compelling upgrade.Yeah, Erik, as you point out, we decreased by 6.5% year-over-year for the whole of Greater China. And if you look at it on a constant currency basis, we declined by less than 3%. So over 50% of the decline year-over-year is currency related. That is an improvement from the first half of the fiscal year, and so we're happy to see the acceleration. If you look at iPhone in particular for Greater China, the installed base set a record. We also in Mainland China set a June quarter record for upgraders and so that's a very strong signal and in fact from Kantar -- the survey from Kantar this quarter showed that iPhones were the top three models in urban China. Also, if you look at -- one of the things we look at is the 15 family compared to the 14 family for the same number of weeks from launch. So this goes all the way back to the September of 2023. If you look at that, the 15 is outperforming the 14. And so those are some of the color I would provide. In addition, one of the things that we're very focused on is the level of new customers buying our products. And so if you look at this on the Mac and iPad, in Mainland China, the majority of customers buying or buying for the first time, buying that product for the first time and the watch, the vast, vast majority of people are buying a product for the first time. And during the quarter, I should say also that iPad returned to growth in Greater China, as it did around the world. And so we continue to be confident in the long-term opportunity in China. I don't know how every chapter of the book reads, but we're very confident in the long-term.We started the rollout of Apple Intelligence this week with developers, so some of the features are out there as of Monday. And we couldn't be more excited about getting them out there. Obviously, this will enable developers to take their apps to the next level. And so we are taking the first step in getting the beta out there, and we can't wait to see what kind of amazing things they do with it.We just announced the sort of the requirements at the system and the silicon level in June. And so we had very limited time during the quarter. So it's really too early to tell.We are very excited about Apple Intelligence and what it brings, and it is another compelling reason for an upgrade. I'd leave the promotional question for the sort of the carriers themselves to answer. But I believe it will be a very key time for -- and a compelling upgrade cycle.The rollout, as we mentioned in June, sort of -- we've actually started with developers this week. We started with some features of Apple Intelligence, not the complete suite. There are other features like languages beyond US English that will happen over the course of the year, and there are other features that will happen over the course of the year. And ChatGPT is integrated by the end of the calendar year. And so yes, so it’s a staggered launch.I think the way that I look at it is that Apple Intelligence is the on-device processing and the Private Cloud Compute. And a lot of that will be things with a personal context. And then for world knowledge, we are integrating with ChatGPT initially, and that will be focused on world knowledge as I said. And so the monetization model, I don't want to get into the terms of the commercial agreements because they are confidential between the parties. But I see both aspects as being very important. People want both.Well, certainly, the competitive environment there is the most competitive in the world. I've said that before and that remains to be the case. The macroeconomic factors have been in the press too, and I'm not an expert on those. I can only tell you what we're seeing. And we were pleased that the business showed improvement from the first half of the year.If you look at how we've deployed Apple Intelligence or are deploying Apple Intelligence, we've really thought about it at pretty much all of the apps that you use every day. And so we've thought about it from Notes to Mail to Messages and all the rest. And so there is been a deep level of thinking about how it affects those apps. And that's going to surface Apple Intelligence in a way that is natural to the user, in a way that will I think, get them very excited about it and get usage. Similarly, I think the developers will do that on a broad basis with their apps as well. And so I think, it is profound and we'll see what the developers do. But we're very excited to get the initial seed out there this week and see what they do. I think it will be amazing, yes.Our objective that we said in June is to roll out US English starting in the fall and that is to users, and then proceed with more functionality, more features, if you will, and more languages and regions coverage as we proceed across the next year. And so we sort of gave a time frame that -- and we're tracking to that.We are engaged as you would guess, with both regulatory bodies that you mentioned. And our objective is to move as fast as we can, obviously because our objective is always to get features out there for everyone. We have to understand the regulatory requirements before we can commit to doing that and commit a schedule to doing that. But we're very constructively engaged with both.Yes, I'll take that one. I think the important thing to remember when you look at the Wearables, Home and Accessories categories is that we have a difficult launch compare. And we've been running that for a few quarters and we still have that because last year had the continued benefit from the AirPods Pro second generation, the Watch SE and the very first Watch Ultra. And so it is important to keep that in mind. If you sort of take a step back, however and look at the business across the trailing 12 months, it is grown -- the Wearables, Home and Accessories business has grown to almost $40 billion, which is double what it was five years ago.Clearly, we have increased R&D over time. We have been investing in AI and ML for years. And in addition to investing more, we've also redeployed certain skills onto AI and ML. And so the growth in sort of embedded in our numbers that we've shared here, it is increasing year-over-year. On the CapEx part, it is important to remember that we employ a hybrid kind of approach, where we do things internally and we have certain partners that we do business with externally where the CapEx would appear in their respective businesses. But yes, I mean you can expect that there is -- we will continue to invest and increase it year-on-year."
}