{
    "text": "Yeah. Hi. It's -- we are incredibly excited about the Enterprise opportunities with Vision Pro. I've seen several demos from different companies. Luca mentioned several in his opening remarks, but Walmart has a very cool merchandising app. There are firms that are doing collaboration -- design collaboration apps. There are field service applications. Really all over the map, there are applications that are for control center, command center kind of things. SAP has really gotten behind it and, of course, SAP is in so many of companies. I think there will be a great opportunity for us in Enterprise, and we couldn't be more excited about where things are right now. We are obviously looking forward to tomorrow. This has been multiple years of efforts from so many people across Apple. And really, it took a whole of company effort to bring it to this far. In terms of generative AI, which, I'd guess, is your focus, we have a lot of work going on internally as I've alluded to before. Our MO, if you will, has always been to do work and then talk about work and not to get out in front of ourselves. And so, we're going to hold that to this as well. But we've got some things that we are incredibly excited about that we'll be talking about later this year.Hi, it's Tim. The -- we were up 6%, as we mentioned in the opening remarks. We are happy with that performance. Underneath there, we had really strong performance in several parts of the world with all-time records in Europe and rest of Asia-Pacific. As I mentioned earlier, we did particularly well in several emerging markets from Latin America to the Middle East. And we set December quarter records in India and Indonesia. And so, really some spectacular broad-based reactions to iPhone. We also importantly set an all-time record worldwide for iPhone upgraders. And the installed base hit a new all-time high consistent with the -- our overall devices. And so, there's lot of good things. Luca mentioned in his opening comments that iPhones were four out of the top five smartphone models in the U.S. and Japan and four out of the top six in urban China and the UK, and all top five in Australia, and the customer satisfaction level for iPhone 15 hit 99%. If you look at iPhone 15 since the announcement of it and shipment in September, so this is including some of Q4 and you compare that to iPhone 14 over the same period of time, iPhone 15 is outselling iPhone 14. And so, we feel very good about that, and the upgraders hitting a record is particularly exciting for us.You know, each product has its own journey. And so, I wouldn't want to compare it to any one in particular. I would just say we couldn't be more excited. Internally, we've got an incredible amount of excitement from developers and from customers that can't wait till tomorrow to pick up their units. And we are incredibly proud to be able to demo the unit in so many of our stores in the U.S. starting tomorrow for people that are -- that want to check it out. And so, we'll see and report the results of it in the Wearables category that you're familiar with. I think that if you look at it from a price point of view, there's an incredible amount of technology that's packed into the product. There's 5,000 patents in the product and it's, of course, built on many innovations that Apple has spent multiple years on, from silicon to displays and significant AI and machine learning. All the hand tracking, the room mapping, all of this stuff is driven by AI. And so, we're incredibly excited about it. I can't wait to be in the store for tomorrow and see the reaction myself.Yeah. If you look at iPhone in China Mainland, which I think has been the focus of a lot of interest, and you look at it in constant currency, so more of an operational view, we were down mid-single digits on iPhone. And so, it was the other things that drove the larger contraction year-over-year. On the good news side, we had solid growth on upgraders year-over-year in Mainland China and we had four of the top six smartphone models in urban China. Also, IDC just put out a note, that you may have seen, that we were the top brand in -- for the full year and for the December quarter. And so, there's some good news along with – obviously, we'd prefer not to [contract] (ph).We've really concluded that we can do both. That if you look at it, what has happened over the last several years is that, employees are in a position in many companies to choose their own technology that is the best for them. And so, it sort of took some of the central command from the traditional company and decentralized the decision-making. That is a huge advantage for Apple, because there's a lot of people out there that want to use a Mac. They're using a Mac at home. They'd like to use one in the office as well. iPad has also benefited from that. Vision Pro, it's -- when you look at the ton of use cases, I mean, we're starting with a million apps and 600 plus that are -- have been designed particularly for Vision Pro. When I look at what is coming out of Enterprise, it's some of the most innovative things I've seen come out of Enterprise in a long time. And so, I think there's a like there is for the Mac and iPad, and of course, iPhone has been in enterprise since the early days of iPhone. I think there's a nice opportunity there for Vision Pro as well.Ben, we've been in China for 30 years. And I remain very optimistic about China over the long term. And I feel good about hitting a new install base number, high watermark and very good about the growth in upgraders year-over-year during the quarter.Let me just say that, I think there's a huge opportunity for Apple with GenAI and AI. And without getting into to more details and getting out in front of myself."
}