{
    "text": "Thanks, Michael. As I noted in my comments, just this week on Monday, we made the first set of Apple Intelligence features available in US English for iPhone, iPad, and Mac. This includes things like systemwide Writing Tools that help you refine your writing, a more natural conversational Siri, more intelligent Photos app, including the ability to create movies, simply by typing a description, which is really cool, and new ways to prioritize and stay in the moment with notification summaries and priority messages. There's also email summaries and email priority. We're getting a lot of positive feedback from developers and customers. And in fact, if you just look at the first three days, which is all we have obviously from Monday, the 18.1 adoption is twice as fast as the 17.1 adoption was in the year-ago quarter. And so, there's definitely interest out there for Apple Intelligence. Carrying on in the quarter, we are looking forward to bringing even more features in December, and this will include even more powerful Writing Tools and visual intelligence experience that builds on Apple Intelligence, and ChatGPT integration in addition to other features, as well as we'll bring localized English to several countries that include the UK, Australia, and Canada. So, it's going to be quite a software quarter between the release on Monday and the release in December. And then, as we turn the corner to '25, we'll have more languages rolling out, starting in April as well and more features as well. And so, it's a very strong drumbeat, and we couldn't be more excited about it.There's a lot there. On Apple Intelligence, we believe it's a compelling upgrade reason. And we'll -- but we just launched it three days ago and so what we've got now from a data point point of view is the number I just referenced that 18.1 has twice the adoption rate of 17.1. So, that clearly shows a level of interest out there. In terms of exiting the December quarter with demand greater than supply, that's not my recollection that, that happened for all four of the years. We clearly had cases during COVID where there were disruptions and that's the some spilled over, but in a more regular environment where we're not having something, a 100-year flood kind of thing, we would -- our desire is to get into balance as quickly as possible. We don't want customers having to wait for products. And so, if you look at how we've done this year, we did that very quickly on the 16, on the 16 Pro family, the Pro and the Pro Max, we've been constrained in October, but we believe that soon we'll be out of constraint. And so, that's a good sign from our point of view. Keep in mind that, that's a function of supply and demand, not one side or the other. And we've been preparing for the quarter for a while. So that's what I would say there.Yeah, thank you.Ben, I could not be more excited about Apple Intelligence and the rollout that we've got in front of us. I'm on the -- I'm obviously on future releases as well, working on it and it's changing my daily life. I'm super excited about the health features that we're rolling out. If the number of emails I'm already getting from customers that have taken a hearing test and are using their AirPods Pro 2 as a hearing aid, are just -- are staggering and heartwarming to read. I'm also thrilled about sleep apnea and the notification there that we'll have through the watch. This week is a very exciting week for us because we just rolled out three days -- three launches of different, Macs and desktops and laptops. And so, we have a lot of things on the docket and it's definitely the strongest lineup we've ever had going into the holiday season. In terms of the noise, I tune it out, because if not, it would just be, deafening. And so that that's what I do, I can't speak for everybody else, but that's what I do.Yeah, David. It's clearly, as you point out, a different cadence, if you will, than we would normally do. As we talked about at WWDC, we wanted to give a comprehensive vision of Apple Intelligence, and we said then that it would rollout over time. And we're right on the, what we said, at WWDC, and so we're executing well. In terms of the demand curve, I would just say that what we believe here is that it's a compelling reason for upgrading. And, it's -- that's both my personal experience and feedback that I'm getting and so we'll see. We're not projecting, beyond the current quarter obviously. We just don't do that.If you look at our schedule, we started in the -- with US English, that started on Monday. There's another release coming that adds additional features that I had referenced in December in not only US English but also localized for UK, Australia, Canada, Ireland, and New Zealand. And then, we will add more languages in April. We haven't set the specifics yet in terms of the languages, but we'll add more in April and then more as we step through the year. And so, we're moving just as fast as possible while ensuring quality. That's what we're doing.Yeah.I wouldn't want to speculate about those sorts of things. And so, I'm going to punt on that one.I think, just to keep it in mind, Apple Intelligence is also available on the Mac for the M-series products and on certain models of iPad, and in addition to the phone. And so, it's on all three. You're quite -- what was your follow-on question?Keep in mind that we were have released a lot of APIs and developers will be taking advantage of those APIs. That release has occurred as well and of course more are coming. And so I, definitely believe that a lot of developers will be taking advantage of Apple Intelligence in a big way. And what that does to Services, I'll not forecast, but I would say that from an ecosystem point of view, I think it will be great for the user and the user experience.It's tough to answer your question, because we've been constrained in October on the Pro and the Pro Max. And so, it's really too early in the curve to call the precise mix on the consumer versus the Pro. So, we'll see.I don't want to speculate on that from a legal point of view. It's an ongoing case, and I will save that for another day.The way that I view it is that we have lots of opportunity in all of those. And so, there's lots of customers to try to convince to take advantage of it, and we're going to continue investing in the Services and adding new features and -- whether it's News+ or Music or Arcade, that's what we're going to do. Keep in mind that for us, we're more focused on being best than being most. And so, in some cases, not in every case, some of the services that you -- the majority of the services that you mentioned are not cross platform. We make them for our customers only and so that in some cases changes the person who's going to sell the most perhaps, but that's -- our objective is to make the best."
}